[
  {
    "id": 1,
    "title": "E-Library UKIP Makassar",
    "description": "E-Library UKIP Paulus Makassar adalah sebuah platform perpustakaan digital yang dirancang untuk mempermudah pengelolaan dan akses terhadap berbagai jenis bahan pustaka di lingkungan kampus. Website ini dilengkapi dengan fitur-fitur utama seperti manajemen e-book, skripsi, jurnal ilmiah, serta aset buku fisik.<br> Selain itu, sistem ini juga mendukung proses peminjaman dan pengembalian buku secara digital, serta menyediakan fasilitas pengajuan dokumen akademik seperti SKBP 1 dan SKBP 2. Dengan implementasi sistem ini, proses administrasi perpustakaan menjadi lebih efisien, terstruktur, dan mudah diakses oleh mahasiswa maupun staf kampus.",
    "img": "projects1.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 2,
    "title": "Absensi Karyawan Wika Beton",
    "description": "Aplikasi ini dirancang khusus untuk mendukung kebutuhan pencatatan kehadiran pegawai WIKA Beton yang beroperasi di wilayah Sulawesi Selatan. Sistem ini memungkinkan pencatatan absensi harian dan lembur secara digital, sehingga mempermudah proses monitoring dan evaluasi kinerja karyawan. Selain itu, aplikasi ini juga dilengkapi dengan fitur pengelolaan data pegawai, mulai dari informasi pribadi hingga penugasan kerja sesuai dengan proyek atau divisi masing-masing. <br> Fungsi lainnya mencakup kemampuan untuk melakukan rekap laporan kehadiran secara otomatis, baik dalam bentuk harian, mingguan, bulanan, maupun tahunan. Dengan tampilan antarmuka yang sederhana dan mudah digunakan, aplikasi ini membantu bagian HR maupun manajemen dalam meningkatkan efisiensi dan akurasi dalam pengelolaan sumber daya manusia di lingkungan perusahaan.",
    "img": "projects2.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 3,
    "title": "Company Profile SMKS Persada Makassar",
    "description": "Website ini dikembangkan sebagai media informasi resmi untuk memperkenalkan SMKS Persada Makassar kepada masyarakat luas. Tampilan yang sederhana dan responsif dirancang agar mudah diakses oleh berbagai kalangan, baik siswa, orang tua, maupun masyarakat umum. <br> Website ini memuat informasi penting seperti halaman beranda (home), profil singkat sekolah (about), data guru (teacher), informasi kontak sekolah (contacts), serta halaman khusus untuk Penerimaan Peserta Didik Baru (PPDB). <br> Dengan adanya website ini, sekolah dapat menyampaikan informasi secara lebih efektif dan memperluas jangkauan promosi secara digital, terutama saat masa penerimaan siswa baru berlangsung.",
    "img": "projects3.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 4,
    "title": "EVENT ASMPID 2025",
    "description": "Website ini dikembangkan sebagai platform resmi untuk mendukung pelaksanaan acara ASMPID 2025. Tidak hanya berfungsi sebagai company profile acara, website ini juga menjadi pusat informasi dan media pendaftaran bagi peserta. <br> Fitur utama dari website ini mencakup sistem registrasi online, dashboard admin untuk mengelola data pendaftar, serta notifikasi email otomatis yang dikirim saat pendaftaran berhasil diverifikasi. Setiap pendaftar juga akan menerima barcode unik yang dapat digunakan sebagai identitas saat check-in di lokasi acara. <br> Dengan adanya sistem ini, proses administrasi menjadi lebih efisien, akurat, dan modern, serta mempermudah panitia dalam pengelolaan peserta dan validasi kehadiran.",
    "img": "projects4.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 5,
    "title": "Aplikasi Survei Kepuasan Alumni UNM",
    "description": "Aplikasi ini dikembangkan untuk mendukung proses pengumpulan dan analisis data kepuasan alumni di lingkungan Universitas Negeri Makassar (UNM). Platform ini memungkinkan kampus untuk secara sistematis menjaring feedback dari alumni terkait layanan pendidikan dan pengalaman mereka selama menempuh studi. <br> Website ini dilengkapi dengan fitur pengelolaan soal survei, pengelolaan jawaban responden, serta push notification untuk memastikan alumni menerima pemberitahuan terkait partisipasi survei. Selain itu, aplikasi ini juga telah dioptimalkan sebagai Progressive Web App (PWA), memungkinkan pengguna untuk mengakses dan menggunakan aplikasi secara ringan dan responsif melalui perangkat mobile, bahkan dalam kondisi jaringan terbatas. <br> Dengan adanya sistem ini, proses survei menjadi lebih efisien, terstruktur, dan dapat diakses dengan mudah oleh alumni, sekaligus memberikan data yang berharga bagi peningkatan kualitas pendidikan di UNM.",
    "img": "projects5.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 6,
    "title": "Aplikasi E-Office Infolahtadam Hasanuddin Makassar",
    "description": "Aplikasi ini dikembangkan sebagai solusi digital untuk mendukung proses administrasi dan pengelolaan arsip di lingkungan Infolahtadam Hasanuddin Makassar. Sistem ini dirancang untuk menggantikan proses manual dengan pendekatan yang lebih efisien, terstruktur, dan mudah diakses secara internal oleh setiap divisi. <br> Fitur utama dalam aplikasi ini meliputi pengelolaan user, pengelolaan arsip file berdasarkan divisi, serta pengelolaan arsip persuratan yang juga dikategorikan per divisi. Dengan sistem ini, setiap unit kerja dapat dengan mudah mengunggah, mengakses, dan mengelola dokumen atau surat menyurat sesuai dengan wewenangnya. <br>Implementasi E-Office ini bertujuan untuk meningkatkan efektivitas kerja, mempercepat distribusi informasi internal, serta menjaga kerapihan dan keamanan data arsip secara digital.",
    "img": "projects6.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 7,
    "title": "Aplikasi Pengelola Keuangan SMKS Persada Makassar",
    "description": "Aplikasi ini merupakan sistem informasi keuangan yang dirancang khusus untuk SMKS Persada Makassar dan diinstal pada server lokal sekolah. Tujuan utama dari aplikasi ini adalah untuk mempermudah dan menertibkan proses pencatatan serta pengelolaan keuangan internal sekolah secara digital dan terpusat. <br> Melalui aplikasi ini, staf keuangan dapat melakukan berbagai aktivitas penting seperti pencatatan pemasukan dan pengeluaran, pengelolaan transaksi harian, serta pencetakan nota dan rekap laporan keuangan. Selain itu, aplikasi juga menyediakan fitur ekspor laporan dalam format PDF dan Excel yang memudahkan dalam pelaporan administrasi atau keperluan audit. <br> Dengan implementasi aplikasi ini, proses keuangan menjadi lebih transparan, efisien, dan terdokumentasi dengan baik.",
    "img": "projects7.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 8,
    "title": "CMS Arifah Islamic School Makassar",
    "description": "Aplikasi ini merupakan Content Management System (CMS) yang dikembangkan khusus untuk Arifah Islamic School Makassar. CMS ini bertujuan untuk memudahkan pihak sekolah dalam mengelola konten website secara dinamis, tanpa memerlukan pengetahuan teknis mendalam. <br> Beberapa fitur utama yang tersedia dalam aplikasi ini antara lain adalah pengelolaan halaman custom sesuai kebutuhan sekolah, manajemen blog untuk publikasi berita dan artikel, serta dukungan multi-bahasa untuk menjangkau audiens yang lebih luas. Selain itu, terdapat juga fitur pengaturan user untuk mengelola hak akses dan peran pengguna dalam sistem. <br> Dengan adanya CMS ini, pihak sekolah dapat memperbarui informasi dengan cepat, menjaga tampilan web tetap relevan, dan membangun komunikasi digital yang lebih baik dengan siswa, orang tua, dan masyarakat.",
    "img": "projects8.png",
    "linkProjects": "https://projects.com"
  },
  {
    "id": 9,
    "title": "Zabbix Bot Notification Telegram",
    "description": "Zabbix Bot Notification Telegram adalah sebuah sistem integrasi antara Zabbix dan Telegram Bot yang dikembangkan untuk memberikan notifikasi otomatis mengenai kondisi jaringan secara real-time. Project ini digunakan untuk memantau traffic jaringan pada perangkat Mikrotik CCR serta mengawasi jumlah host Ubiquiti dan Ruckus yang terhubung melalui protokol SNMP. <br> Setiap satu jam, sistem ini akan mengirimkan laporan ke Telegram yang mencakup informasi penting seperti jumlah host yang sedang aktif, host yang tidak terdeteksi atau mengalami gangguan, dan laporan detail mengenai host yang mengalami kondisi down. Tujuan dari sistem ini adalah untuk membantu tim operasional dalam memantau performa jaringan secara terus-menerus dan merespons masalah dengan lebih cepat dan efisien.",
    "img": "projects9.png",
    "linkProjects": "https://projects.com"
  }
]
